app/controllers/empleados_controller.rb

SELECT "empleados".* FROM "empleados"
---
  def index
    @empleados = Empleado.all

INSERT INTO "empleados" ("ci", "nombre", "apellidos", "profesion", "numeroCuenta", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["ci", 231], ["nombre", "ewweqe"], ["apellidos", "qweqwe"], ["profesion", "qweqwe"], ["numeroCuenta", "qweqwe"], ["created_at", 2017-05-03 19:05:32 UTC], ["updated_at", 2017-05-03 19:05:32 UTC]]
---
  def create
    @empleado = Empleado.new(empleado_params)

    respond_to do |format|
      if @empleado.save

UPDATE "empleados" SET "ci" = ?, "updated_at" = ? WHERE "empleados"."id" = ?  [["ci", 0], ["updated_at", 2017-05-03 19:05:42 UTC], ["id", 2]]
---
  def update
    respond_to do |format|
      if @empleado.update(empleado_params)

DELETE FROM "empleados" WHERE "empleados"."id" = ?  [["id", 2]]
---
  def destroy
    @empleado.destroy

SELECT  "empleados".* FROM "empleados" WHERE "empleados"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_empleado
      @empleado = Empleado.find(params[:id])